emacs/.config/emacs/config.org
# Created 2025-01-30 Thu 12:11
#+title: Emacs Configuration
#+author: Endi Merkuri

* Configuration
** Early Initialization
#+begin_src emacs-lisp :tangle early-init.el
  ;;; early-init.el --- Early Init -*- no-byte-compile: t; lexical-binding: t; -*-

  ;; Ensure Emacs loads the most recent byte-compiled files.
  (setq load-prefer-newer t)

  ;; Ensure JIT compilation is enabled for improved performance by
  ;; native-compiling loaded .elc files asynchronously
  (setq native-comp-jit-compilation t)

  (setq gc-cons-threshold 100000000)
  (setenv "LSP_USE_PLISTS" "true")
  (setq read-process-output-max (* 1024 1024)) ;; 1mb
  (setq byte-compile-warnings '(not obsolete))
  (setq warning-suppress-log-types '((comp) (bytecomp)))
  (setq native-comp-async-report-warnings-errors 'silent)

  ;; Silence stupid startup message
  (setq inhibit-startup-echo-area-message (user-login-name))

  ;; Default frame configuration: full screen, good-looking title bar on macOS
  (setq frame-resize-pixelwise t)
  (setq default-frame-alist '((fullscreen . maximized)
                              ;; Setting the face in here prevents flashes of
                              ;; color as the theme gets activated
                              (background-color . "#000000")
                              (foreground-color . "#ffffff")
                              (ns-appearance . dark)
                              (ns-transparent-titlebar . t)))
#+end_src

** Initialization
*** Package manager
#+begin_src emacs-lisp :tangle init.el
   ;;; init.el --- Init -*- no-byte-compile: t; lexical-binding: t; -*-

  (require 'package)
  (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)

  (when (< emacs-major-version 29)
    (unless (package-installed-p 'use-package)
      (unless package-archive-contents
        (package-refresh-contents))
      (package-install 'use-package)))

  (use-package exec-path-from-shell
    :ensure t
    :config
    (when (memq window-system '(mac ns x pgtk))
      (exec-path-from-shell-initialize)))
#+end_src

*** Compile .el files
#+begin_src emacs-lisp :tangle init.el
  (setq compile-angel-excluded-files-regexps '("^/usr/share/.*"))
  (use-package compile-angel
    :ensure t
    :demand t
    :config
    (setq compile-angel-verbose t)
    (compile-angel-on-load-mode)
    (add-hook 'emacs-lisp-mode-hook #'compile-angel-on-save-local-mode))
#+end_src

*** Use "custom.el" file for custom variables added automatically
#+begin_src emacs-lisp :tangle init.el
  (setq mac-command-modifier 'meta)
  (when (string= system-type "darwin")
    (setq dired-use-ls-dired nil))
  (setq use-package-verbose t)
  (setq custom-file (locate-user-emacs-file "custom.el"))
  (load custom-file :no-error-if-file-is-missing)
#+end_src

*** Do not display full line if line too long.
#+begin_src emacs-lisp :tangle init.el
  (set-default 'truncate-lines t)
#+end_src

*** Auto revert config?
#+begin_src emacs-lisp :tangle init.el
  (setopt display-time-default-load-average nil) ; this information is useless for most

  ;; Automatically reread from disk if the underlying file changes
  (setopt auto-revert-avoid-polling t)
  ;; Some systems don't do file notifications well; see
  ;; https://todo.sr.ht/~ashton314/emacs-bedrock/11
  (setopt auto-revert-interval 5)
  (setopt auto-revert-check-vc-info t)
  (global-auto-revert-mode)
  (setopt sentence-end-double-space nil)
#+end_src

*** Show line and column number in the modeline
#+begin_src emacs-lisp :tangle init.el
  (setopt line-number-mode t)                        ; Show current line in modeline
  (setopt column-number-mode t)                      ; Show column as well
#+end_src

*** Show line numbers and autoclose parenthesis in programming mode
#+begin_src emacs-lisp :tangle init.el
  ;; Display line numbers in programming mode
  (add-hook 'prog-mode-hook 'display-line-numbers-mode)
  (add-hook 'prog-mode-hook 'electric-pair-mode)
  (setopt display-line-numbers-width 3)           ; Set a minimum width
#+end_src

#+begin_src emacs-lisp :tangle init.el
  (setopt x-underline-at-descent-line nil)           ; Prettier underlines
  (setopt switch-to-buffer-obey-display-actions t)   ; Make switching buffers more consistent

  ;; Nice line wrapping when working with text
  (add-hook 'text-mode-hook 'visual-line-mode)

  ;; Modes to highlight the current line with
  (let ((hl-line-hooks '(text-mode-hook prog-mode-hook)))
    (mapc (lambda (hook) (add-hook hook 'hl-line-mode)) hl-line-hooks))
#+end_src

*** Steady cursor, smooth scrolling
#+begin_src emacs-lisp :tangle init.el
  (blink-cursor-mode -1)
  (pixel-scroll-precision-mode)
#+end_src

#+begin_src emacs-lisp :tangle init.el
  (recentf-mode t)
  (setq inhibit-startup-message t)

  (menu-bar-mode -1)
  (when (fboundp 'tool-bar-mode)
    (tool-bar-mode -1))
  (when (fboundp 'scroll-bar-mode)
    (scroll-bar-mode -1))
  (when (fboundp 'horizontal-scroll-bar-mode)
    (horizontal-scroll-bar-mode -1))

  (autoload 'zap-up-to-char "misc"
    "Kill up to, but not including ARGth occurrence of CHAR." t)

  (require 'uniquify)
  (setq uniquify-buffer-name-style 'forward)

  ;; https://www.emacswiki.org/emacs/SavePlace
  (save-place-mode 1)

  (global-set-key (kbd "M-/") 'hippie-expand)
  (global-set-key (kbd "C-x C-b") 'ibuffer)
  (global-set-key (kbd "M-z") 'zap-up-to-char)

  (global-set-key (kbd "C-s") 'isearch-forward-regexp)
  (global-set-key (kbd "C-r") 'isearch-backward-regexp)
  (global-set-key (kbd "C-M-s") 'isearch-forward)
  (global-set-key (kbd "C-M-r") 'isearch-backward)

  ;; change cursor width based on character
  ;; (setq x-stretch-cursor t)

  (show-paren-mode 1)
  (setq-default indent-tabs-mode nil)
  (savehist-mode 1)
  (setq save-interprogram-paste-before-kill t
        apropos-do-all t
        mouse-yank-at-point t
        require-final-newline t
        visible-bell t
        load-prefer-newer t
        backup-by-copying t
        frame-inhibit-implied-resize t
        read-file-name-completion-ignore-case t
        read-buffer-completion-ignore-case t
        completion-ignore-case t
        ediff-window-setup-function 'ediff-setup-windows-plain
        custom-file (expand-file-name "custom.el" user-emacs-directory))
#+end_src

*** Put all backup and autosaves file in Emacs directory
#+begin_src emacs-lisp :tangle init.el
  (unless backup-directory-alist
    (setq backup-directory-alist `(("." . ,(concat user-emacs-directory
                                                   "backups")))))

  ;; auto-save files directory
  (make-directory (expand-file-name "tmp/auto-saves/" user-emacs-directory) t)
  (setq auto-save-list-file-prefix (expand-file-name "tmp/auto-saves/sessions/" user-emacs-directory)
        auto-save-file-name-transforms `((".*" ,(expand-file-name "tmp/auto-saves" user-emacs-directory) t)))
#+end_src

*** Better terminal
#+begin_src emacs-lisp :tangle init.el
  (use-package vterm
    :ensure t
    :defer t
    :commands vterm
    :config
    ;; Speed up vterm
    (setq vterm-timer-delay 0.01))
#+end_src

*** Docker Controls
#+begin_src emacs-lisp :tangle init.el
  (use-package docker
    :ensure t
    :commands docker
    :config
    (setq docker-container-columns
          '((:name "Id" :width 16 :template "{{ json .ID }}" :sort nil :format nil)
            (:name "Names" :width 50 :template "{{ json .Names }}" :sort nil :format nil)
            (:name "Image" :width 15 :template "{{ json .Image }}" :sort nil :format nil)
            (:name "Created" :width 23 :template "{{ json .CreatedAt }}" :sort nil :format
                   (lambda
                     (x)
                     (format-time-string "%F %T"
                                         (date-to-time x))))
            (:name "Status" :width 20 :template "{{ json .Status }}" :sort nil :format nil))
          ))
#+end_src

*** Auto install and enable treesitter modes
#+begin_src emacs-lisp :tangle init.el
  (use-package treesit-auto
    :ensure t
    :custom
    (treesit-auto-install 'prompt)
    :config
    (treesit-auto-add-to-auto-mode-alist 'all)
    (global-treesit-auto-mode))
#+end_src

*** Auto delete region when starting to type
#+begin_src emacs-lisp :tangle init.el
  (use-package delsel
    :ensure nil ; no need to install it as it is built-in
    :hook (after-init . delete-selection-mode))
#+end_src

