emacs/.config/emacs/config.org
*** Completion plugins
#+begin_src emacs-lisp :tangle init.el
  (use-package vertico
    :ensure t
    :defer t
    :commands vertico-mode
    :hook (after-init . vertico-mode)
    :custom
    (vertico-cycle t)
    (vertico-resize nil))

  (use-package marginalia
    :ensure t
    :defer t
    :commands (marginalia-mode marginalia-cycle)
    :hook (after-init . marginalia-mode))

  (use-package orderless
    :ensure t
    :custom
    (completion-styles '(orderless basic))
    (completion-category-defaults nil)
    (completion-category-overrides nil))

  (use-package savehist
    :ensure nil ; it is built-in
    :hook (after-init . savehist-mode))

  (use-package corfu
    :ensure t
    :defer t
    :commands (corfu-mode global-corfu-mode)
    :hook ((prog-mode . corfu-mode)
           (shell-mode . corfu-mode)
           (eshell-mode . corfu-mode))
    :bind (:map corfu-map ("<tab>" . corfu-complete))
    :custom
    ;; Hide commands in M-x which do not apply to the current mode.
    (read-extended-command-predicate #'command-completion-default-include-p)
    ;; Disable Ispell completion function. As an alternative try `cape-dict'.
    (text-mode-ispell-word-completion nil)
    (tab-always-indent 'complete)

    ;; Enable Corfu
    :config
    (global-corfu-mode))

  (use-package cape
    :ensure t
    :defer t
    :commands (cape-dabbrev cape-file cape-elisp-block)
    :bind ("C-c p" . cape-prefix-map)
    :init
    (add-hook 'completion-at-point-functions #'cape-file))
#+end_src

*** Dired and Trashed
#+begin_src emacs-lisp :tangle init.el
  (use-package dired
    :ensure nil
    :commands (dired)
    :hook
    ((dired-mode . dired-hide-details-mode)
     (dired-mode . hl-line-mode))
    :config
    (setq dired-recursive-copies 'always)
    (setq dired-recursive-deletes 'always)
    (setq delete-by-moving-to-trash t)
    (setq dired-dwim-target t))

  (use-package dired-subtree
    :ensure t
    :after dired
    :bind
    ( :map dired-mode-map
      ("<tab>" . dired-subtree-toggle)
      ("TAB" . dired-subtree-toggle)
      ("<backtab>" . dired-subtree-remove)
      ("S-TAB" . dired-subtree-remove))
    :config
    (setq dired-subtree-use-backgrounds nil))

  (use-package trashed
    :ensure t
    :commands (trashed)
    :config
    (setq trashed-action-confirmer 'y-or-n-p)
    (setq trashed-use-header-line t)
    (setq trashed-sort-key '("Date deleted" . t))
    (setq trashed-date-format "%Y-%m-%d %H:%M:%S"))
#+end_src

*** Git
#+begin_src emacs-lisp :tangle init.el
  (use-package magit
    :ensure t
    :commands (magit-status magit-clone))
#+end_src

*** Lsp and snippets
#+begin_src emacs-lisp :tangle init.el
  (use-package eglot
    :ensure nil
    :defer t
    :commands (eglot
               eglot-rename
               eglot-ensure
               eglot-format-buffer)

    :custom
    (eglot-report-progress nil)  ; Prevent minibuffer spam

    :config
    ;; Optimizations
    (fset #'jsonrpc--log-event #'ignore)
    (setq jsonrpc-event-hook nil))

  (add-hook 'js-mode-hook #'eglot-ensure)
  (add-hook 'js-ts-mode-hook #'eglot-ensure)
  (add-hook 'go-mode-hook #'eglot-ensure)
  (add-hook 'go-ts-mode-hook #'eglot-ensure)
  (add-hook 'python-mode-hook #'eglot-ensure)
  (add-hook 'python-ts-mode-hook #'eglot-ensure)

  (use-package yasnippet
    :ensure t)
  (use-package yasnippet-snippets
    :ensure t)
  (yas-reload-all)
  (add-hook 'prog-mode-hook #'yas-minor-mode)

  (use-package format-all
    :ensure t
    :commands format-all-buffer)
#+end_src

*** Emacs lsp booster
Delete and install lsp mode again before enabling lsp booster.
Note: install lsp booster with =cargo install emacs-lsp-booster=
#+begin_src emacs-lisp :tangle init.el
  (use-package eglot-booster
    :after eglot
    :config	(eglot-booster-mode))
#+end_src

*** Automatically detect indent level
#+begin_src emacs-lisp :tangle init.el
  (use-package dtrt-indent
    :ensure t
    :config
    (setq dtrt-indent-min-quality 100)
    (setq dtrt-indent-hook-mapping-list
          (cons '(js-ts-mode javascript (js-indent-level standard-indent)) dtrt-indent-hook-mapping-list))
    :hook (after-init . dtrt-indent-global-mode))
#+end_src

