emacs/.config/emacs/config.org
*** Modus theme config
#+begin_src emacs-lisp :tangle init.el
  (setq modus-themes-italic-constructs t
        modus-themes-bold-constructs t)
  (setq modus-themes-region '(bg-only no-extend))
  (setq modus-themes-headings
        '((1 . (rainbow overline background 1.4))
          (2 . (rainbow background 1.3))
          (3 . (rainbow bold 1.2))
          (t . (semilight 1.1))))

  (setq modus-themes-scale-headings t)
  (setq modus-themes-org-blocks 'tinted-background)

  (setq modus-themes-mode-line '(accented borderless 4))
  (load-theme 'modus-vivendi t)
#+end_src

*** Dotenv file support
#+begin_src emacs-lisp :tangle init.el
  (use-package dotenv-mode
    :ensure t
    :config
    (add-to-list 'auto-mode-alist '("\\.env\\..*\\'" . dotenv-mode)))
#+end_src

*** Dashboard
#+begin_src emacs-lisp :tangle init.el
  (use-package dashboard
    :ensure t
    :init
    (setq initial-buffer-choice 'dashboard-open)
    :custom
    (dashboard-display-icons-p t)     ; display icons on both GUI and terminal
    (dashboard-icon-type 'nerd-icons) ; use `nerd-icons' package
    (dashboard-set-file-icons t)
    (dashboard-items '((recents   . 5)
                       (bookmarks . 5)
                       (projects  . 5)
                       (agenda    . 5)
                       (registers . 5)))
    (dashboard-startupify-list '(dashboard-insert-banner
                                 dashboard-insert-newline
                                 dashboard-insert-banner-title
                                 dashboard-insert-newline
                                 dashboard-insert-navigator
                                 dashboard-insert-newline
                                 dashboard-insert-init-info
                                 dashboard-insert-items
                                 dashboard-insert-newline))
    (dashboard-startup-banner 'logo)
    ;; Content is not centered by default. To center, set
    (dashboard-center-content t)
    ;; vertically center content
    (dashboard-vertically-center-content t)
    :config
    (dashboard-setup-startup-hook))
#+end_src

*** Copilot plugin
#+begin_src emacs-lisp :tangle init.el
  (use-package copilot
    :ensure t
    :commands (copilot-mode))
#+end_src

*** More treesitter highlighting
#+begin_src emacs-lisp :tangle init.el
  (setq treesit-font-lock-level 4)
#+end_src

*** Modeline
#+begin_src emacs-lisp :tangle init.el
  (defun my-modeline--major-mode-name ()
    "Return capitalized `major-mode' as a string."
    (format "%18s" (capitalize (replace-regexp-in-string "-ts" "" (replace-regexp-in-string "-mode" "" (symbol-name major-mode))))))

  (defvar-local my-modeline-major-mode
      '(:eval
        (propertize (my-modeline--major-mode-name) 'face 'bold))
    "Mode line construct to display the major mode.")

  (put 'my-modeline-major-mode 'risky-local-variable t)

  (defun mode-line-fill (reserve)
    "Return empty space using FACE and leaving RESERVE space on the right."
    (when
        (and window-system (eq 'right (get-scroll-bar-mode)))
      (setq reserve (- reserve 3)))
    (propertize " "
                'display
                `((space :align-to (- (+ right right-fringe right-margin) ,reserve)))))

  (setq-default mode-line-format
                (list '("%e" mode-line-front-space
                        (:propertize "[%*] " display (min-width ...))
                        (:eval (propertize "%b" 'face 'bold))  "   " "L%l" "   " "%o" "  "
                        (vc-mode vc-mode) "  "  mode-line-misc-info)
                      (mode-line-fill 20) my-modeline-major-mode))
#+end_src

*** Treesitter based movement/selection
#+begin_src emacs-lisp :tangle init.el
  (use-package combobulate
    :custom
    (combobulate-key-prefix "C-c o")
    :config
    (setq combobulate-flash-node nil)
    :hook (
           (go-ts-mode . combobulate-mode)
           (js-ts-mode . combobulate-mode))
    :load-path ("elpa/combobulate"))
#+end_src

*** Which key
#+begin_src emacs-lisp :tangle init.el
  (use-package which-key
    :ensure t
    :config (which-key-mode))
#+end_src

*** Git highlights
#+begin_src emacs-lisp :tangle init.el
  (use-package diff-hl
    :ensure t)
  (global-diff-hl-mode)
#+end_src

*** Rest requests
#+begin_src emacs-lisp :tangle init.el
  (use-package verb
    :ensure t
    :after org
    :defer t)

  (with-eval-after-load 'org
    (define-key org-mode-map (kbd "C-c C-r") verb-command-map))
#+end_src

*** Misc
#+begin_src emacs-lisp :tangle init.el
  (add-to-list 'auto-mode-alist '("\.[cm]js" . js-mode))

  (add-hook 'js-mode-hook
            (lambda() (local-unset-key (kbd "M-."))))
  (add-hook 'js-ts-mode-hook
            (lambda() (local-unset-key (kbd "M-."))))
  (setq ediff-split-window-function 'split-window-horizontally)
  (setq ediff-window-setup-function 'ediff-setup-windows-plain)
#+end_src
