emacs/.config/emacs/init.el

(setq modus-themes-italic-constructs t
      modus-themes-bold-constructs t)
(setq modus-themes-region '(bg-only no-extend))
(setq modus-themes-headings
      '((1 . (rainbow overline background 1.4))
        (2 . (rainbow background 1.3))
        (3 . (rainbow bold 1.2))
        (t . (semilight 1.1))))

(setq modus-themes-scale-headings t)
(setq modus-themes-org-blocks 'tinted-background)

(setq modus-themes-mode-line '(accented borderless 4))
(load-theme 'modus-vivendi t)

(use-package dashboard
  :ensure t
  :config
  (setq dashboard-display-icons-p t)     ; display icons on both GUI and terminal
  (setq dashboard-icon-type 'nerd-icons) ; use `nerd-icons' package
  (setq dashboard-set-file-icons t)
  (setq dashboard-items '((recents   . 5)
                          (bookmarks . 5)
                          (projects  . 5)
                          (agenda    . 5)
                          (registers . 5)))
  (setq dashboard-startupify-list '(dashboard-insert-banner
                                    dashboard-insert-newline
                                    dashboard-insert-banner-title
                                    dashboard-insert-newline
                                    dashboard-insert-navigator
                                    dashboard-insert-newline
                                    dashboard-insert-init-info
                                    dashboard-insert-items
                                    dashboard-insert-newline))
  (setq dashboard-startup-banner 'logo)
  ;; Content is not centered by default. To center, set
  (setq dashboard-center-content t)
  ;; vertically center content
  (setq dashboard-vertically-center-content t)
  (dashboard-setup-startup-hook))

(use-package copilot
  :ensure t
  :commands (copilot-mode))

(setq treesit-font-lock-level 4)

(defun my-modeline--major-mode-name ()
  "Return capitalized `major-mode' as a string."
  (format "%18s" (capitalize (replace-regexp-in-string "-ts" "" (replace-regexp-in-string "-mode" "" (symbol-name major-mode))))))

(defvar-local my-modeline-major-mode
    '(:eval
      (propertize (my-modeline--major-mode-name) 'face 'bold))
  "Mode line construct to display the major mode.")

(put 'my-modeline-major-mode 'risky-local-variable t)

(defun mode-line-fill (reserve)
  "Return empty space using FACE and leaving RESERVE space on the right."
  (when
      (and window-system (eq 'right (get-scroll-bar-mode)))
    (setq reserve (- reserve 3)))
  (propertize " "
              'display
              `((space :align-to (- (+ right right-fringe right-margin) ,reserve)))))

(setq-default mode-line-format
              (list '("%e" mode-line-front-space
                      (:propertize "[%*] " display (min-width ...))
                      (:eval (propertize "%b" 'face 'bold))  "   " "L%l" "   " "%o" "  "
                      (vc-mode vc-mode) "  "  mode-line-misc-info)
                    (mode-line-fill 20) my-modeline-major-mode))

(use-package combobulate
  :custom
  (combobulate-key-prefix "C-c o")
  :hook (
         (go-ts-mode . combobulate-mode)
         (js-ts-mode . combobulate-mode))
  :load-path ("elpa/combobulate"))

(use-package which-key
  :ensure t
  :config (which-key-mode))

(use-package diff-hl
  :ensure t)
(global-diff-hl-mode)

(use-package verb
  :ensure t
  :after org
  :defer t)

(with-eval-after-load 'org
  (define-key org-mode-map (kbd "C-c C-r") verb-command-map))

(add-to-list 'auto-mode-alist '("\.[cm]js" . js-mode))

(setq ediff-split-window-function 'split-window-horizontally)
(setq ediff-window-setup-function 'ediff-setup-windows-plain)
